In [21]:
import pandas as pd
data = [(1,'varun',30,'male','chandigarh'),
        (2,'sachin',40,'female','mumbai'),
        (3,'rahul',25,'male','delhi'),
        (4,'suresh',34,'female','kolkata')]
df = pd.DataFrame(data, columns=['id','name','age','gender','city'])
df

   id    name  age  gender        city
0   1   varun   30    male  chandigarh
1   2  sachin   40  female      mumbai
2   3   rahul   25    male       delhi
3   4  suresh   34  female     kolkata

In [8]:
df[['id','name','age']]

   id    name  age
0   1   varun   30
1   2  sachin   40
2   3   rahul   25
3   4  suresh   34

In [11]:
df.loc[0:2]

   id    name  age  gender        city
0   1   varun   30    male  chandigarh
1   2  sachin   40  female      mumbai
2   3   rahul   25    male       delhi

In [12]:
df.loc[0]

id                 1
name           varun
age               30
gender          male
city      chandigarh
Name: 0, dtype: object

In [14]:
df[df['age'] > 30]
df[df['age'] > 30][['name','city']]

     name     city
1  sachin   mumbai
3  suresh  kolkata

In [19]:
df['phone'] = ['1234567890','0987654321','1122334455','5566778899']
df
# this added a new column

   id    name  age  gender        city       phone
0   1   varun   30    male  chandigarh  1234567890
1   2  sachin   40  female      mumbai  0987654321
2   3   rahul   25    male       delhi  1122334455
3   4  suresh   34  female     kolkata  5566778899

In [20]:
df = df.drop('phone', axis=1)
df

   id    name  age  gender        city
0   1   varun   30    male  chandigarh
1   2  sachin   40  female      mumbai
2   3   rahul   25    male       delhi
3   4  suresh   34  female     kolkata

In [24]:
df.insert(2, 'phone', ['1234567890','0987654321','1122334455','5566778899'])
df

   id    name       phone  age  gender        city
0   1   varun  1234567890   30    male  chandigarh
1   2  sachin  0987654321   40  female      mumbai
2   3   rahul  1122334455   25    male       delhi
3   4  suresh  5566778899   34  female     kolkata

In [26]:
df = df.drop(3)
df
# this deleted the 4th row
# this deleted the 5th row

   id    name       phone  age  gender        city
0   1   varun  1234567890   30    male  chandigarh
1   2  sachin  0987654321   40  female      mumbai
2   3   rahul  1122334455   25    male       delhi

In [23]:
del df['phone']
df

   id    name  age  gender        city
0   1   varun   30    male  chandigarh
1   2  sachin   40  female      mumbai
2   3   rahul   25    male       delhi
3   4  suresh   34  female     kolkata

In [32]:
df.loc[3] = [5,'suresh',35443334,88,'kolkata','rewa']
df

   id    name       phone age   gender        city
0   1   varun  1234567890  30     male  chandigarh
1   2  sachin  0987654321  40   female      mumbai
2   3   rahul  1122334455  77     male       delhi
3   5  suresh    35443334  88  kolkata        rewa

In [33]:
df.loc[2, 'age'] = 77
df

   id    name       phone age   gender        city
0   1   varun  1234567890  30     male  chandigarh
1   2  sachin  0987654321  40   female      mumbai
2   3   rahul  1122334455  77     male       delhi
3   5  suresh    35443334  88  kolkata        rewa